# ViewActivatingEventArgs Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewActivatingEventArgs Class
Members See Also
---
The event arguments used by the ViewActivating event.
**Namespace:** Autodesk.Revit.UI.Events**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public class ViewActivatingEventArgs : RevitAPIPreDocEventArgs
```

Visual Basic
---
```text
Public Class ViewActivatingEventArgs _
	Inherits RevitAPIPreDocEventArgs
```

Visual C++
---
```text
public ref class ViewActivatingEventArgs : public RevitAPIPreDocEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreEventArgs Autodesk.Revit.DB.Events..::..RevitAPIPreDocEventArgs Autodesk.Revit.UI.Events..::..ViewActivatingEventArgs
# See Also
ViewActivatingEventArgs Members
Autodesk.Revit.UI.Events Namespace